var userData = {
    // aaa:{
    //     key:"aaa",
    //     name:"test",
    //     wxcode:"test",
    //     record:[]
    // }
}

var choseData = {
    "狂热行动":{
        val:"狂热行动",
        list:["路飞","萨博","索隆","山治","罗","女帝","路奇","任意大赏","文件夹","盘子","色纸","L路飞异色","任意小赏"]
    },
    "和之国":{
        val:"和之国",
        list:["SP凯多","A路飞","B索隆","C山治","D罗","E萨博","任意大赏","F马克杯","G杯垫","H玻璃杯","I文件夹","L路飞异色","任意小赏"]
    },
    "兄弟羁绊":{
        val:"兄弟羁绊",
        list:["A羁绊","B路飞","C艾斯","D萨博","任意大赏","E笔记本","F玻璃盘","G色纸","L羁绊异色","任意小赏"]
    },
    "美少女":{
        val:"美少女",
        list:["A毛绒","B立镜","C披风","任意大赏","D方巾","E钥匙扣","F文件夹","L变身镜","任意小赏"]
    },
    "少女樱":{
        val:"少女樱",
        list:["A挂架","B毯子","C收纳盒","任意大赏","D收纳袋","E钥匙扣","F手帕","G挂件","L毯子异色","任意小赏"]
    }
}

var awardData = ["","神龙","山治","艾斯","凯多","萨博","蛇人路飞","弹簧人路飞","女帝","路奇","文件夹","毛巾","原画","玻璃杯"]